"use strict";

/*
Необходимо создать переменную dayNumber, в которую пользователь должен ввести 
целое число в интервале [1, 32).
Если пользователь ввел иное значение, необходимо вывести в консоль 
"Неверное значение".
Если пользователь ввел верное значение, в нужном диапазоне, то необходимо 
определить, в какую декаду месяца попадает это число и вывести сообщение в 
консоль: "Число N1 попадает в N2 декаду месяца.", где вместо N1 и N2 будут 
подставлены подходящие значения, которые мы получили.

Примечание: выражение [1, 32) означает от 1 включительно, до 32, не включая 
число 32.
*/

const dayNumber = Number(prompt("Введите целое число в интервале [1, 32)"));

if (dayNumber >= 1 && dayNumber < 32) {
  if (dayNumber >= 1 && dayNumber <= 10) {
    console.log(`"Число ${dayNumber} попадает в 1 декаду месяца."`);
  } else if (dayNumber > 10 && dayNumber <= 20) {
    console.log(`"Число ${dayNumber} попадает в 2 декаду месяца."`);
  } else {
    console.log(`"Число ${dayNumber} попадает в 3 декаду месяца."`);
  }
} else {
  console.log("Неверное значение");
}

// я придумал такое решение. пытался сделать через swich-case,
// чтобы декаду тоже вывести в отдельную переменную и собрать один console.log
// но что-то не додумался за 15 минут))
