/* Этот файл для отображения структуры всего репозитория */
// qs - document.querySelector('selector'); - поиск первого
// ae - document.addEventListener('load', function (e) {// body}); - действие
// cel - document.createElement(); - создать элемент

/*  [
import { readFileSync } from 'fs';
import { writeFileSync } from 'fs';
    'load' - событие срабатывает, когда весь контент (изображения, скрипты) загружен,
    'click' - событие происходит при нажатии на элемент,
    'mousemove' - событие, которое происходит при перемещении мыши над элементом,
    'keydown' - событие, происходящее при нажатии клавиши на клавиатуре,
    'submit' - событие формы, происходящее при отправке формы,
    'scroll' - событие прокрутки, происходящее при прокрутке страницы,
    'resize' - событие изменения размера окна,
    'focus' - событие получения фокуса элементом,
    'blur' - событие потери фокуса элементом,
    ]
*/
// document.setAttribute('тег/название атрибута', 'значение'); - добавить атрибут
// document.removeAttribute('тег/название атрибута'); - удалить атрибут

// document.classList.add('название') - add(добавить класс), remove(удалить класс)
